In [1]:
%load_ext sql

In [2]:
%sql sqlite://

#create table in database

In [11]:
%%sql
CREATE TABLE book(
    book_id INTEGER PRIMARY KEY AUTOINCREMENT,
    title VARCHAR(50),
    author VARCHAR(30),
    price DECIMAL(8,2),
    amount INT
);

 * sqlite://
(sqlite3.OperationalError) table book already exists
[SQL: CREATE TABLE book( book_id INTEGER PRIMARY KEY AUTOINCREMENT,
    title VARCHAR(50),
    author VARCHAR(30),
    price DECIMAL(8,2),
    amount INT
);]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

insert values in table SQL

In [17]:
%%sql
INSERT INTO book (title, author, price, amount)
VALUES ('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3)

 * sqlite://
1 rows affected.

[]

insert any strings in table SQL

In [19]:
%%sql
INSERT INTO book (title, author, price, amount)
VALUES ('Белая гвардия', 'Булгаков М.А.', 540.50, 5);
INSERT INTO book (title, author, price, amount)
VALUES ('Идиот', 'Достоевский Ф.М.', 460.00, 10);
INSERT INTO book (title, author, price, amount)
VALUES ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [20]:
%%sql
SELECT * FROM book

 * sqlite://
Done.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3),
 (2, 'Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3),
 (3, 'Белая гвардия', 'Булгаков М.А.', 540.5, 5),
 (4, 'Идиот', 'Достоевский Ф.М.', 460, 10),
 (5, 'Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2)]